#   3. Склонение слова
#   Реализовать склонение слова «процент» во фразе «N процентов».
#   Вывести эту фразу на экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
interval = list(range(1, 101))
ending = ['', 'а', 'ов']

for i in interval:
    if i % 10 == 1 and i != 11:
        print(f'{i} процент{ending[0]}')
    elif i % 10 in [2, 3, 4] and i % 100 not in [12, 13, 14]:
        print(f'{i} процент{ending[1]}')
    else:
        print(f'{i} процент{ending[2]}')
